[
  {
    "Title": "RC Car Racing",
    "Description": "The RC Car Racing Competition is a high-speed event designed to test the engineering skills, control, and strategy of participants. Teams must design and operate a remote-controlled (RC) car to complete laps on a challenging track in the shortest possible time.",
    "Rules": "1. CAR SPECIFICATIONS\n1. Power Source: Only electric-powered cars are allowed.\n2. Dimensions: The car must fit within a maximum size of 40x30x20 cm (LxWxH).\n3. Weight: Maximum weight limit is 4 kg.\n4. Control System: The car must be strictly wireless-controlled.\n5. Battery: Maximum operating voltage 12V DC.\n6. Chassis & Body: The design should be safe and should not damage the track or other cars.\n7. Safety: Cars with sharp edges or hazardous mechanisms will be disqualified.\n\n2. COMPETITION TRACK\n1. Track Size: The track will be approximately 10m x 5m with multiple turns and obstacles.\n2. Lap Requirements: The total number of laps to be completed will be decided on the event day based on track conditions.\n3. Surface Material: The track surface will be a combination of smooth and rough terrains.\n4. Obstacle Zones: The track may have ramps, speed bumps, and sharp turns to test maneuverability.\n\n3. GAMEPLAY RULES\n1. The event will have three different rounds, each with distinct scoring patterns and elimination criteria.\n2. Each race will be conducted as a time trial or head-to-head race, depending on the round.\n3. The car must start from the designated starting zone.\n4. A car that goes off-track must be placed back at the nearest checkpoint by the participant.\n5. External physical interference with the car during the race is strictly prohibited.\n6. If the car is unable to complete the race due to technical issues, the team may take one retry if time permits.\n\n4. SCORING SYSTEM\n1. Fastest lap time in a round: 50 points\n2. Completing the race within the time limit: 30 points\n3. Touching external boundaries: -5 points per occurrence\n4. Skipping obstacles (if applicable): -10 points\n5. Completing all laps without penalties: Bonus 20 points\n\n5. TEAM STRUCTURE\n1. Each team can have 1 to 3 members.\n2. Multiple entries of the same bot will be allowed.\n3. One member must be designated as the team captain.\n4. Teams must submit a technical report explaining their car's design and working principles.\n\n6. GENERAL RULES & DISQUALIFICATION\n1. Only registered teams and spot registrations are allowed to participate.\n2. Any car that does not adhere to the size, weight, or power restrictions will be disqualified.\n3. Wireless interference with other teams' cars will result in immediate disqualification.\n4. The decision of the judges and event coordinators will be final and binding.",
    "Prize_Pool": "20000",
    "Venue_Location": "Tennis Court"
  },
  {
    "Title": "RC Boat",
    "Description": "The RC Boat Racing Competition is an exciting event that challenges participants to design and operate remote-controlled (RC) boats to complete laps on a water track in the shortest possible time.",
    "Rules": "1. BOAT SPECIFICATIONS\n1. Power Source: Only electric-powered boats are allowed.\n2. Dimensions: The boat must fit within a maximum size of 40x20x15 cm (LxWxH).\n3. Weight: Maximum weight limit is 3 kg.\n4. Control System: The boat must be strictly wireless-controlled.\n5. Battery: Maximum operating voltage 12V DC.\n6. Hull Design: The design should be safe and should not damage the track or other boats.\n7. Safety: Boats with sharp edges or hazardous mechanisms will be disqualified.\n\n2. COMPETITION ARENA\n1. Arena Size: The water racing arena will be approximately 4 feet x 8 feet.\n2. Lap Requirements: The total number of laps to be completed will be decided on the event day based on track conditions.\n3. Water Conditions: The water surface may have small waves or currents.\n4. Obstacle Zones: The track may have buoys and turns to test maneuverability.\n\n3. GAMEPLAY RULES\n1. The event will have three different rounds, each with distinct scoring patterns and elimination criteria.\n2. Each race will be conducted as a time trial or head-to-head race, depending on the round.\n3. The boat must start from the designated starting zone.\n4. A boat that goes off-course must be placed back at the nearest checkpoint by the participant.\n5. External physical interference with the boat during the race is strictly prohibited.\n6. If the boat is unable to complete the race due to technical issues, the team may take one retry if time permits.\n\n4. SCORING SYSTEM\n1. Fastest lap time in a round: 50 points\n2. Completing the race within the time limit: 30 points\n3. Touching external boundaries: -5 points per occurrence\n4. Skipping obstacles (if applicable): -10 points\n5. Completing all laps without penalties: Bonus 20 points\n\n5. TEAM STRUCTURE\n1. Each team can have 1 to 3 members.\n2. Multiple entries of the same boat will be allowed.\n3. One member must be designated as the team captain.\n4. Teams must submit a technical report explaining their boat's design and working principles.\n\n6. GENERAL RULES & DISQUALIFICATION\n1. Only registered teams and spot registrations are allowed to participate.\n2. Any boat that does not adhere to the size, weight, or power restrictions will be disqualified.\n3. Wireless interference with other teams' boats will result in immediate disqualification.\n4. The decision of the judges and event coordinators will be final and binding.\n5. Boats that cause excessive damage to the water track or pose a safety hazard will be disqualified.",
    "Prize_Pool": "20000",
    "Venue_Location": "PMC"
  },
  {
    "Title": "Pick and Place",
    "Description": "The Pick and Place Competition is a test of precision, efficiency, and design innovation. Teams must build a manually or autonomously controlled robot capable of picking up objects and placing them in designated zones within a given time.",
    "Prize_Pool": "20000",
    "Rules": "1. ROBOT SPECIFICATIONS\n1. Dimensions: Maximum 30x30x30 cm (LxWxH) in static condition.\n2. Weight: Maximum 5 kg (including battery).\n3. Power Supply: Maximum operating voltage 12V DC.\n4. Control System: The robot can be wired or wireless. If wireless, teams must ensure interference-free communication.\n5. Gripping Mechanism: The robot must have a gripping mechanism suitable for picking up objects of varying shapes and sizes.\n6. Movement: The robot must be able to navigate the arena and place objects in designated locations.\n7. Safety: Robots must not have sharp edges, flame-based mechanisms, or components that can cause harm to participants or the arena.\n\n2. COMPETITION ARENA\n1. Arena Size: The competition arena will be approximately 5m x 5m with designated zones for object placement.\n2. Object Specifications: Objects will vary in size and shape, and they may include cylindrical, cubical, or spherical elements.\n3. Placement Zones: Marked areas will be provided for object placement, each assigned different points based on difficulty.\n\n3. GAMEPLAY RULES\nThe event will have three different rounds, each with distinct scoring patterns and elimination criteria.\n1. Each team gets 3 minutes to complete the task in every round.\n2. The winning criteria will be changed for all three rounds along with elimination criteria.\n\n4. TEAM STRUCTURE\n1. Each team can have 1 to 3 members.\n2. One member must be designated as the team captain.\n3. Teams must submit a technical report describing their robot's mechanism and working principles before the event.\n\n5. GENERAL RULES & DISQUALIFICATION\n1. Registered teams and spot registrations are allowed to participate.\n2. Multiple entries of the same bot will be allowed.\n3. Any team found violating the specifications will be disqualified.\n4. The decision of the judges and event coordinators will be final and binding.\n5. Teams must adhere to safety guidelines.\n6. Any robot deemed unsafe will not be allowed to participate.",
    "Venue_Location": "PMC"
  }
  
]
