[
    {
      "Title": "Tex Quiz",
      "Description": "Textile Quiz Competition: Weave Your Knowledge! Put your textile expertise to the test in our Textile Quiz Competition! Whether you're a student, professional, or textile enthusiast, this competition is your chance to showcase your knowledge, compete with the best, and win exciting prizes. Are you ready to unravel the world of textiles? Join us and prove your expertise!",
      "Rules": "1. Individual participation is allowed\n2. There are 3 rounds:\n   a. MCQ\n   b. Orient the jumbled words\n   c. Rapid fire\n3. Students will be eliminated with each round\n4. Last round will contain only 5 students in which 1 will be runner up and 1 will be winner",
      "Prize_Pool": "5000",
      "Venue_Location": "Textile Department"
    },
    {
      "Title": "Style Your Partner",
      "Description": "Unleash your creativity in Style Your Partner, a unique fashion challenge where teams transform textiles into stunning outfits! With a mix of fabric, accessories, and design skills, participants will craft stylish looks for their partners within a set time. Whether it's traditional elegance or modern trends, this event tests your fashion sense, innovation, and styling abilities. Think fashion, think creativity—are you ready to style and shine?",
      "Rules": "1. Group of 2 person\n2. Only for Textile Students\n3. Participant must be ready half hour before event\n4. Equipment or make up product will not be provided\n5. Student should design & style their partner in a very appropriate way\n6. There should be not be any kind of vulgarity in the dress design.",
      "Prize_Pool": "15000",
      "Venue_Location": "Textile Department"
    },
    {
      "Title": "Draw Your Design",
      "Description": "Let your imagination flow in Draw Your Design, a creative competition where aspiring designers bring their ideas to life on paper! Whether it's a futuristic outfit, a traditional masterpiece, or an avant-garde textile concept, this event challenges participants to sketch unique and innovative fashion or textile designs. Showcase your artistic skills, attention to detail, and design aesthetics as you compete to impress the judges. If you can dream it, you can draw it! Join us and create your masterpiece.",
      "Task": "To draw the given design idea or design theme in the given time. Only a theme or idea will be given to the students Students should draw using their imagination & creativity",
      "Rules": "1. Participation: 1 member only (Open for all Engineering/Polytechnic students)\n2. Theme/Idea will be allotted on the event day\n3. Only drawing sheet will be provided\n4. Students should carry their own pen, pencil, colors and other stationary\n5. Time for Drawing design is 2 Hours\n6. Use of Mobile Phone & any other electronic gadget is strictly prohibited",
      "Prize_Pool": "5000",
      "Venue_Location": "Textile Department"
    }
    
  ]